chipKIT32/chipKIT-cxx/src45x/binutils/bfd/pic32-allocate.c
  if (pic32_debug)
    printf("    removing from allocation list\n");
  pic32_remove_from_section_list(alloc_section_list,s);

  return result;
} /* locate_single_section() */


/*
 * locate_sections()
 *
 * This function attempts to locate all sections
 * in the section list that match a specified
 * attribute mask. The block argument specifies
 * attributes that disqualify a section.
 *
 * Called by: allocate_program_memory()
 *            allocate_data_memory()
 *            allocate_eedata_memory()
 *            allocate_auxflash_memory()
 *
 * Calls:     select_free_block()
 *            update_section_info()
 *            create_remainder_blocks()
 *            remove_free_block()
 *            remove_alloc_section()
 *
 * Returns:   status code
 *            (0 = success)
 */
static int
locate_sections(unsigned int mask, unsigned int block,
                struct memory_region_struct *region) {
  struct pic32_section *s,*next;
  int result = 0;
  static int ramfunc_section_count = 0;

  if (pic32_debug) {
    printf("\nLocating sections with mask %x, but not %x\n", mask, block);
    printf("  locate_options = %x, exclude_addr = %lx\n",
           locate_options, exclude_addr);
  }

  for (s = alloc_section_list; s != NULL; s = next) {

    next = s->next;
    if (s->sec && (s->attributes & mask) &&
        ((s->attributes & block) == 0)) {
      bfd_vma len = s->sec->rawsize? s->sec->rawsize: s->sec->size;

      if (pic32_debug) {
        char *attr = pic32_section_attr_string(s->sec);

        printf("  b \"%s\", len = %lx, %s\n",
               s->sec->name, (unsigned long)len, attr ? attr : "");
        if (attr) free(attr);
      }

      if (PIC32_IS_RAMFUNC_ATTR(s->sec)) {
          if (ramfunc_section_count == 0) {
              set_locate_options(FAVOR_HIGH_ADDR,0);
              s->sec->alignment_power = 11;
              ramfunc_section_count++;
              result |= locate_group_section(s, region);
              if (s->sec->vma == 0)
                {
                  report_allocation_error(s);
                }
              ramfunc_begin = s->sec->vma;
              if (!bfd_pic32_is_defined_global_symbol("_ramfunc_begin")) {
                _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_ramfunc_begin",
                                    BSF_GLOBAL, bfd_abs_section_ptr,
                                    ramfunc_begin, "_ramfunc_begin", 1, 0, 0);
              } else {
                einfo(_("Link Warning: Cannot define '_ramfunc_begin' due to existing definition; check linker script\n"));
              }
              if (pic32_debug)
                printf("  _ramfunc_begin = %x\n", (unsigned int)ramfunc_begin);
              if (!bfd_pic32_is_defined_global_symbol("_bmxdkpba_address")) {
                _bfd_generic_link_add_one_symbol (&link_info, link_info.output_bfd, "_bmxdkpba_address",
                                    BSF_GLOBAL, bfd_abs_section_ptr,
                                    ramfunc_begin - region->origin, "_bmxdkpba_address", 1, 0, 0);
              } else {
                einfo(_("Link Warning: Cannot define '_bmxdkpba_address' due to existing definition; check linker script\n"));
              }
              if (pic32_debug)
                printf("  _bmxdkpba_address = %x\n", (unsigned int)(ramfunc_begin - region->origin));
            }
        }
      else {
          result |= locate_single_section(s, region);
        }
    }

  }
  return result;
} /* locate_sections() */


/*
 * next_aligned_address()
 */
static bfd_vma
next_aligned_address( bfd_vma start, unsigned int align_power) {

  bfd_vma mask = ~((~0) << align_power);
  return (bfd_vma) ((start + 1 + mask) & (~mask));
}


/*
 * prev_aligned_address()
 */
static bfd_vma
prev_aligned_address( bfd_vma start, unsigned int align_power) {

  bfd_vma mask = ~((~0) << align_power);
  if (start < mask)
    return (bfd_vma) 0;
  else
    return (bfd_vma) ((start - 1 - mask) & (~mask));
}


/*
 * select_free_block()
 *
 * This function attempts to select a suitable
 * free block for a specified section. For each
 * free block, the section is positioned two ways:
 *  (1) as close to the starting address as possible,
 *  (2) as close to the ending address as possible.
 *
 * The position that leaves the largest unused
 * remainder space is selected. If a suitable free
 * block is found, the block offset is written into
 * the free block structure and the structure is returned.
 *
 * The selection algorithm can be fine-tuned by previous
 * calls to set_locate_options().
 *
 * Called by: locate_sections()
 *            locate_group_sections()
 *
 * Calls:     pic32_static_assign_memory()
 *            next_aligned_address()
 *            prev_aligned_address()
 *
 * Returns:   suitable free block, or 0
 */

#if 0
static void
confirm_dma_range_defined() {
  struct bfd_link_hash_entry *h;
  static bfd_boolean base_err_reported = FALSE;
  static bfd_boolean end_err_reported = FALSE;

  if ((!dma_base_defined) || (!dma_end_defined)) {

    h = bfd_pic32_is_defined_global_symbol(str3);
    if (h) {
      dma_base = h->u.def.value;
      dma_base_defined = TRUE;
    }
    else {
      if (!base_err_reported) {
        einfo(_(str1), str3);
        base_err_reported = TRUE;
      }
    }

    h = bfd_pic32_is_defined_global_symbol(str4);
    if (h) {
      dma_end = h->u.def.value;
      dma_end_defined = TRUE;
    }
    else {
      if (!end_err_reported) {
        einfo(_(str1), str4);
        end_err_reported = TRUE;
      }
    }
  }
}
#endif


static struct pic32_memory *
select_free_block(struct pic32_section *s, unsigned int len) {

  unsigned int align_power = s->sec->alignment_power;

  const char *err_str1 = "Link Error: Could not allocate section";

  struct pic32_memory *b;
  bfd_vma option1, limit1;
  bfd_vma option2, limit2;
  bfd_boolean option1_valid, option2_valid;

  /*
   * If the section is absolute, call the static function
   */
  if (PIC32_IS_ABSOLUTE_ATTR(s->sec)) {

    b = pic32_static_assign_memory(free_blocks, len, s->sec->lma);
    if (!b) {
        if ((s->sec->flags & SEC_NEVER_LOAD) ||
            (command_line.check_section_addresses == FALSE))
          /* OK, don't report as error */;
        else
          einfo(_("%X %s \'%s\' at 0x%v\n"),
                err_str1, s->sec->name, s->sec->lma);
        return (struct pic32_memory *) NULL;
    } else
      return b;
  }

