chipKIT32/chipKIT-cxx/src45x/binutils/bfd/pic32-allocate.c
/*
 * finish_section_info()
 *
 * called by:
 *  update_section_info()
 *  update_grouped_section_info()
 *
 * Note that we don't copy in the section size,
 * because lang_process() will calculate the
 * output section size after the emulation
 * returns control.
 */
static void
finish_section_info(struct pic32_section *s, lang_output_section_statement_type *os)
{
  etree_type *addr_tree;

  if (os->bfd_section == NULL) /* --gc-sections discarded this, so done */
    return;
  os->bfd_section->vma = s->sec->vma;
  os->bfd_section->lma = s->sec->lma;
  addr_tree = xmalloc(sizeof(etree_type));
  addr_tree->value.type.node_class = etree_value;
  addr_tree->value.value = s->sec->vma;
  os->addr_tree = addr_tree;

} /* finish_section_info() */


#define update_section_addr(s,addr)                     \
  {                                                     \
  s->lma = addr;                                        \
  s->vma = addr;                                        \
  }

/*
 * update_section_info()
 *
 * Update section info after allocation
 *
 * If section was a heap or stack, set some globals.
 *
 * Note: argument region is currently unused.
 *
 */
static void
update_section_info(bfd_vma alloc_addr,
                    struct pic32_section *s,
                    struct memory_region_struct *region) {

  lang_output_section_statement_type *os;
  char *name;

  update_section_addr(s->sec, alloc_addr);

  if (pic32_debug) {
    printf("    updating section info:"
           "  vma = %lx, lma = %lx\n", s->sec->vma, s->sec->lma);
  }

  /* create a unique name for the output section */
    name = (s->sec->size > 0) ?
    unique_section_name(s->sec->name) :
    unique_zero_length_section_name(s->sec->name);

  /* create an output section (statement) */
  os = lang_output_section_statement_lookup (name, 0, TRUE);


  if (pic32_debug)
    printf("    creating output section statement \"%s\"\n\n", os->name);

  /* lang_add_section() will call init_os() if needed */
  lang_add_section (&os->children, s->sec, NULL, os);

  finish_section_info(s, os);
  region = region;
} /* update_section_info() */

/*
 * update_group_section_info()
 *
 * Update group section info after allocation
 *
 * Note: argument region is currently unused.
 */
static void
update_group_section_info(bfd_vma alloc_addr,
                    struct pic32_section *g,
                    struct memory_region_struct *region ATTRIBUTE_UNUSED) {

  struct pic32_section *s, *next;
  asection *sec;
  char *name;
  bfd_vma addr = alloc_addr;
  lang_output_section_statement_type *os;

  /* create a unique name for the output section, if necessary */
     sec = bfd_get_section_by_name(link_info.output_bfd, g->sec->name);
     if (sec) {
       name = ( g->sec->size > 0) ?
               unique_section_name(g->sec->name) :
               unique_zero_length_section_name(g->sec->name);
     }
     else {
       name = (char *) g->sec->name;
       if (PIC32_IS_RAMFUNC_ATTR(g->sec))
         strcpy(name, ".RAMFUNC$");
     }
  /* create an output section (statement) */
  os = lang_output_section_statement_lookup (name, 0, TRUE);
  if (pic32_debug)
    printf("    creating output section statement \"%s\"\n", os->name);

  /* loop through the input sections in this group */
  for (s = g; s != NULL; s = next) {
    next = s->next;
    if (s->sec && (PIC32_IS_RAMFUNC_ATTR(s->sec))) {
      update_section_addr(s->sec, addr);
      addr += (s->sec->size);

      /* lang_add_section() will call init_os() if needed */
      lang_add_section (&os->children, s->sec, NULL, os);

      if (pic32_debug)
        printf("    updating grouped section info:"
               "  vma = %lx, lma = %lx\n", s->sec->vma, s->sec->lma);
    }
  }
  finish_section_info(g, os);
} /* update_group_section_info() */


/*
 * create_remainder_blocks()
 *
 * Create [0,1,2] remainder blocks based on
 * block->offset and section->size.
 */
static void
create_remainder_blocks(struct pic32_memory *lst,
                        struct pic32_memory *b, unsigned int len) {

  bfd_vma remainder = b->size - (len + b->offset);

  if (pic32_debug)
    printf("    creating remainder blocks: %lx, %lx\n",
           b->offset, remainder);

  if (b->offset > 0)  /* gap at beginning */
    pic32_add_to_memory_list(lst, b->addr, b->offset);

  if (remainder > 0)  /* gap at end */
    pic32_add_to_memory_list(lst,
                             b->addr + b->offset + len, remainder);
} /* create_remainder_blocks() */


/*
 * insert_alloc_section()
 *
 * Insert a pic32_section into the list
 *  in order of decreasing size or alignment power.
 *
 * Note: a new copy of the pic32_section is made
 *
 */
static void
insert_alloc_section (struct pic32_section *lst,
                      struct pic32_section *as)
{
  struct pic32_section *new, *prev, *s;
  int done = 0;

  /* create a new element */
  new = ((struct pic32_section *)
         xmalloc(sizeof(struct pic32_section)));
  new->sec  = as->sec;
  new->attributes = as->attributes;
  new->file = as->file;

  /* insert it at the right spot */
  prev = lst;
  for (s = prev; s != NULL; s = s->next)
    {
      if (s->sec && ((new->sec->size > s->sec->size) ||
          ((bfd_vma)(1 << new->sec->alignment_power) > s->sec->size)) ) {
        prev->next = new;
        new->next = s;
        done++;
        break;
      }
      prev = s;
    }

  if (!done)
    {
      prev->next = new;
      new->next = NULL;
    }
} /* insert_alloc_section() */


/*
 * build_alloc_section_list()
 *
 * Build alloc_section_list from the
 * list of unassigned_sections, based on
 * an attribute mask.
 *
 * Sort the list in order of decreasing S,
 * where S is the greater of size and
 * alignment requirement.
 *
 * Note: If a section has length zero,
 * we allocate it anyway, although it
 * is stripped from the output file.
 * The linker needs to have an output
 * section statement created for it.
 *
 * Future enhancement:
 *   If --re-order-sections is set, also
 *   add explicity mapped output sections
 *   unless they have an absolute address.
 */
static void
build_alloc_section_list(unsigned int mask) {
  struct pic32_section *s, *prev, *next;

  if (alloc_section_list)
    pic32_free_section_list(&alloc_section_list);

