chipKIT32/chipKIT-cxx/src45x/binutils/bfd/pic32-allocate.c
  pic32_init_section_list(&alloc_section_list);

  /* insert the unassigned sections */
  prev = unassigned_sections;
  for (s = prev; s != NULL; s = next) {

    next = s->next;
    /* Don't add gc-sections to the alloc list */
    if (s->sec && (s->sec->flags & SEC_EXCLUDE))
      continue;
    if (s->attributes & mask) {
      if (pic32_debug)
        printf("  input section \"%s\", len = %lx, flags = %x, attr = %x\n",
               s->sec->name, s->sec->rawsize? s->sec->rawsize :
               s->sec->size, s->sec->flags, s->attributes);

      insert_alloc_section(alloc_section_list, s);
      prev->next = next; /* unlink it from unassigned_sections */
    } else
      prev = s;
  }
} /* build_alloc_section_list() */


/*
 * build_free_block_list()
 *
 * Build a list of free memory blocks
 * in a specified region.
 *
 * Sort the list in order of increasing size.
 *
 * Future enhancement:
 *   If --re-order-sections is set, add free blocks
 *   for explicity mapped output sections unless
 *   they have an absolute address.
 */
static void
build_free_block_list(struct memory_region_struct *region,
                      unsigned int mask ATTRIBUTE_UNUSED) {
  int cnt = 0;
  bfd_vma len, dot, limit, ma;
  struct pic32_section *s;

  if (free_blocks)
    pic32_free_memory_list(&free_blocks);

  pic32_init_memory_list(&free_blocks);

  if (pic32_debug)
    printf("\nBuilding free block list for region \"%s\"\n"
           "  origin = %lx, length = %lx, current = %lx\n",
           region->name_list.name, region->origin, region->length, region->current );

  /* find any gaps left by sequential allocator */
  dot = region->origin;
  limit = dot + region->length;
  for (s = pic32_section_list; s != NULL; s = s->next) {

      if (pic32_debug && s->sec)
        printf("    Checking (section \"%s\", lma = %lx, vma = %lx, len = %lx, attr = %x)\n",
               s->sec->name, s->sec->lma, s->sec->vma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);

    if (s->sec && (s->use_vma==0) &&
        (s->sec->lma >= region->origin) &&
           (s->sec->lma <= (region->origin + region->length)))
        ma = s->sec->lma;
    else if (s->sec && (s->use_vma) &&
        (s->sec->vma >= region->origin) &&
           (s->sec->vma <= (region->origin + region->length)))
        ma = s->sec->vma;
    else
        ma = 0;

    if ((s->sec) && ((s->sec->rawsize | s->sec->size) > 0) && ma) {
      if (pic32_debug)
        printf("    (section \"%s\", addr = %lx, len = %lx, attr = %x)\n",
               s->sec->name, ma,
               s->sec->rawsize? s->sec->rawsize : s->sec->size,
               s->attributes);
      if (ma == dot)                   /* no gap, just advance dot */
        dot += s->sec->rawsize? s->sec->rawsize : s->sec->size;
      else if (ma >= limit)   /* section belongs to another region */
        continue;
      else if (ma > dot) {               /* a gap preceeds section */
        len = ma - dot;                          /* compute length */
        if (pic32_debug)
          printf("  block %d, addr = %lx, len = %lx\n",
                 ++cnt, dot, len);
        pic32_add_to_memory_list(free_blocks, dot, len);  /* add free block */
        dot += len + (s->sec->rawsize? s->sec->rawsize : s->sec->size);           /* advance dot    */
      }
    }
  }

  /* add a block for any free space remaining in this region */
  /* .. use dot, because region->current may have been set for CodeGuard */
  len = region->length - (dot - region->origin);
  if (len > 0) {
    if (pic32_debug)
      printf("  block %d, addr = %lx, len = %lx\n",
             ++cnt, dot, len);
    pic32_add_to_memory_list(free_blocks, dot, len);
  }
} /* build_free_block_list() */


/*
 * remove_free_block()
 *
 * Remove an item from the free memory blocks list.
 *
 */
static void
remove_free_block(struct pic32_memory *b) {
  pic32_remove_from_memory_list(free_blocks, b);
}


/*
 * allocate_default_stack()
 *
 * If a stack section was not explicitly defined,
 * and the stack init symbols were not defined,
 * then this function is called to allocate the
 * largest stack possible from data_memory_free_blocks.
 *
 * Called by: bfd_pic32_finish()
 *
 * Calls:     pic32_add_to_memory_list()
 *            pic32_remove_from_memory_list()
 *
 * Returns:   sets global vars stack_base, stack_limit
 *
 * Notes: The free blocks list is sorted in order
 *        of increasing size
 *
 *        The calling function will confirm that
 *        the resulting stack satisfies the minimum
 *        size requirements.
 *
 *
 */

static void
allocate_default_stack() {
  struct pic32_memory *big_block = 0;
  struct pic32_memory *b, *next;
  bfd_vma under,over;
#define KSEG1_DATA_MEM_LIMIT 0xAFFFFFFFul;
  bfd_vma max_addr = KSEG1_DATA_MEM_LIMIT;

  /* if a free block straddles the upper limit, divide it */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    next = b->next;
    if ((b->addr < max_addr) && ((b->addr + b->size) > max_addr)) {

      if (pic32_debug)
        printf("  free block at %lx crosses upper stack limit (%lx)\n",
               b->addr, max_addr);

      under = max_addr - b->addr;
      over  = (b->addr + b->size) - max_addr;

      pic32_add_to_memory_list(data_memory_free_blocks, b->addr, under);
      pic32_add_to_memory_list(data_memory_free_blocks, max_addr, over);
      pic32_remove_from_memory_list(data_memory_free_blocks, b);
      break;
    }
  }

  /* find the largest block that qualifies */
  for (b = data_memory_free_blocks; b != NULL; b = next) {
    if (b->addr < max_addr)
      big_block = b;
    next = b->next;
  }

  if ((int)(pic32_heap_size) >
      (int)big_block->size) {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + (big_block->size) - 0x80u);
    einfo("%P%X Error: Not enough memory for heap"
          " (%d bytes needed, %d bytes available)\n",
            (int)(pic32_heap_size),
            (int)(heap_limit - heap_base));
  } else {
    heap_base = (big_block->addr + 1);
    heap_limit = (heap_base + pic32_heap_size);
  }
  while (heap_base % 8 != 0)
    heap_base++;
  while (heap_limit % 8 != 0)
    heap_limit++;

  stack_base  = (heap_limit + 1 + pic32_stackguard_size);
  stack_limit = (heap_base + big_block->size
                 - pic32_stackguard_size + 1);
  /* Stack must be aligned by 8 */
  while (stack_base % 8 != 0)
    stack_base++;
  while (stack_limit % 8 != 0)
    stack_limit--;

  if (pic32_debug) {
    printf("  selecting block at %lx\n", big_block->addr);
    printf("  heap base = %x, heap limit = %x\n", heap_base, heap_limit);
    printf("  stack base = %x, stack limit = %x\n", stack_base, stack_limit);
  }

  /* remove the block that we just used */
  pic32_remove_from_memory_list(data_memory_free_blocks, big_block);
}


